<!DOCTYPE html>
<html lang="zn-ch">
<head>
  <meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">
<meta name="generator" content="Hexo 7.3.0">
  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png">
  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png">
  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png">
  <link rel="mask-icon" href="/images/logo.svg" color="#222">

<link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/lib/font-awesome/css/all.min.css">

<script id="hexo-configurations">
    var NexT = window.NexT || {};

<p>在clang中可以使用如下命令：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc</span><br><span class="line">// 查看对象布局</span><br><span class="line">clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -c model.cc</span><br><span class="line">// 查看虚函数表布局</span><br></pre></td></tr></table></figure></p>
<p>上面两种方式其实足够了，也可以使用gdb来查看内存布局，这里可以看文末相关参考资料。本文都是使用clang来查看的对象布局。</p>
<p>接下来让我们一起来探秘下各种继承条件下类对象的布局情况吧~</p>
<h3 id="普通类对象的布局"><a href="#普通类对象的布局" class="headerlink" title="普通类对象的布局"></a>普通类对象的布局</h3><p>如下代码：<br><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">Func</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br><span class="line"></span><br><span class="line"><span class="comment">// 使用clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc查看</span></span><br></pre></td></tr></table></figure></p>
<p>输出如下：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Base</span><br><span class="line">        0 |   int a</span><br><span class="line">        4 |   int b</span><br><span class="line">          | [sizeof=8, dsize=8, align=4,</span><br><span class="line">          |  nvsize=8, nvalign=4]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>从结果中可以看见，这个普通结构体Base的大小为8字节，a占4个字节，b占4个字节。</p>
<h3 id="带虚函数的类对象布局"><a href="#带虚函数的类对象布局" class="headerlink" title="带虚函数的类对象布局"></a>带虚函数的类对象布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br><span class="line"></span><br><span class="line"><span class="comment">// 这里可以查看对象的布局和相应虚函数表的布局</span></span><br><span class="line">clang -Xclang -fdump-record-layouts -stdlib=libc++ -c model.cc</span><br><span class="line">clang -Xclang -fdump-vtable-layouts -stdlib=libc++ -c model.cc</span><br></pre></td></tr></table></figure>
<p>对象布局如下：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Base</span><br><span class="line">        0 |   (Base vtable pointer)</span><br><span class="line">        8 |   int a</span><br><span class="line">       12 |   int b</span><br><span class="line">          | [sizeof=16, dsize=16, align=8,</span><br><span class="line">          |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</p>
<p>虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Base&#x27; (5 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Base RTTI</span><br><span class="line">      -- (Base, 0) vtable address --</span><br><span class="line">  2 | Base::~Base() [complete]</span><br><span class="line">  3 | Base::~Base() [deleting]</span><br><span class="line">  4 | void Base::FuncB()</span><br></pre></td></tr></table></figure></p>
<p>我们来探秘下传说中的虚函数表：</p>
<p>offset_to_top(0)：表示当前这个虚函数表地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</p>
<p>RTTI指针：指向存储运行时类型信息(type_info)的地址，用于运行时类型识别，用于typeid和dynamic_cast。</p>
<p>RTTI下面就是虚函数表指针真正指向的地址啦，存储了类里面所有的虚函数，至于这里为什么会有两个析构函数，大家可以先关注对象的布局，最下面会介绍。</p>
<h3 id="单继承下不含有覆盖函数的类对象的布局"><a href="#单继承下不含有覆盖函数的类对象的布局" class="headerlink" title="单继承下不含有覆盖函数的类对象的布局"></a>单继承下不含有覆盖函数的类对象的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Base FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> Base&#123;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>子类对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct Base (primary base)</span><br><span class="line">        0 |     (Base vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">          | [sizeof=16, dsize=16, align=8,</span><br><span class="line">          |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>和上面相同，这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</p>
<p>子类虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (5 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Derive RTTI</span><br><span class="line">      -- (Base, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  2 | Derive::~Derive() [complete]</span><br><span class="line">  3 | Derive::~Derive() [deleting]</span><br><span class="line">  4 | void Base::FuncB()</span><br></pre></td></tr></table></figure></p>
<p><img src="/img/20220316193500.jpg" alt=""></p>
<p>这个和上面也是相同的，注意下虚函数表这里的FuncB函数，还是Base类中的FuncB，因为在子类中没有重写这个函数，那么如果子类重写这个函数后对象布局是什么样的，请继续往下看哈。</p>
<h3 id="单继承下含有覆盖函数的类对象的布局"><a href="#单继承下含有覆盖函数的类对象的布局" class="headerlink" title="单继承下含有覆盖函数的类对象的布局"></a>单继承下含有覆盖函数的类对象的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Base FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> Base&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>子类对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct Base (primary base)</span><br><span class="line">        0 |     (Base vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">          | [sizeof=16, dsize=16, align=8,</span><br><span class="line">          |  nvsize=16, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>依旧和上面相同，这个含有虚函数的结构体大小为16，在对象的头部，前8个字节是虚函数表的指针，指向虚函数的相应函数指针地址，a占4个字节，b占4个字节，总大小为16。</p>
<p>子类虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (5 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Derive RTTI</span><br><span class="line">      -- (Base, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  2 | Derive::~Derive() [complete]</span><br><span class="line">  3 | Derive::~Derive() [deleting]</span><br><span class="line">  4 | void Derive::FuncB()</span><br></pre></td></tr></table></figure></p>
<p><img src="/img/20220316193600.png" alt=""></p>
<p>注意这里虚函数表中的FuncB函数已经是Derive中的FuncB啦，因为在子类中重写了父类的这个函数。</p>
<p>再注意这里的RTTI中有了两项，表示Base和Derive的虚表地址是相同的，Base类里的虚函数和Derive类里的虚函数都在这个链条下，这里可以继续关注下面多继承的情况，看看有何不同。</p>
<h3 id="多继承下不含有覆盖函数的类对象的布局"><a href="#多继承下不含有覆盖函数的类对象的布局" class="headerlink" title="多继承下不含有覆盖函数的类对象的布局"></a>多继承下不含有覆盖函数的类对象的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseA</span> &#123;</span><br><span class="line">   <span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseB</span> &#123;</span><br><span class="line">   <span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseB FuncC\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> BaseA, <span class="keyword">public</span> BaseB&#123;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   BaseA a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>类对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct BaseA (primary base)</span><br><span class="line">        0 |     (BaseA vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">       16 |   struct BaseB (base)</span><br><span class="line">       16 |     (BaseB vtable pointer)</span><br><span class="line">       24 |     int a</span><br><span class="line">      28 |     int b</span><br><span class="line">         | [sizeof=32, dsize=32, align=8,</span><br><span class="line">         |  nvsize=32, nvalign=8]</span><br></pre></td></tr></table></figure></p>
<p>Derive大小为32，注意这里有了两个虚表指针，因为Derive是多继承，一般情况下继承了几个带有虚函数的类，对象布局中就有几个虚表指针，并且子类也会继承基类的数据，一般来说，不考虑内存对齐的话，子类（继承父类）的大小=子类（不继承父类）的大小+所有父类的大小。</p>
<p>虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (10 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Derive RTTI</span><br><span class="line">      -- (BaseA, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  2 | Derive::~Derive() [complete]</span><br><span class="line">  3 | Derive::~Derive() [deleting]</span><br><span class="line">  4 | void BaseA::FuncB()</span><br><span class="line">  5 | offset_to_top (-16)</span><br><span class="line">  6 | Derive RTTI</span><br><span class="line">      -- (BaseB, 16) vtable address --</span><br><span class="line">  7 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line">  8 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line">  9 | void BaseB::FuncC()</span><br></pre></td></tr></table></figure></p>
<p>可画出对象布局图如下：<br><img src="/img/20220316193601.png" alt=""></p>
<p>offset_to_top(0)：表示当前这个虚函数表（BaseA，Derive）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</p>
<p>再注意这里的RTTI中有了两项，表示BaseA和Derive的虚表地址是相同的，BaseA类里的虚函数和Derive类里的虚函数都在这个链条下，截至到offset_to_top(-16)之前都是BaseA和Derive的虚函数表。</p>
<p>offset_to_top(-16)：表示当前这个虚函数表（BaseB）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为-16，这里用于this指针偏移，下一小节会介绍。</p>
<p>注意下后面的这个RTTI：只有一项，表示BaseB的虚函数表，后面也有两个虚析构函数，为什么有四个Derive类的析构函数呢，又是怎么调用呢，请继续往下看~</p>
<h3 id="多继承下含有覆盖函数的类对象的布局"><a href="#多继承下含有覆盖函数的类对象的布局" class="headerlink" title="多继承下含有覆盖函数的类对象的布局"></a>多继承下含有覆盖函数的类对象的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseA</span> &#123;</span><br><span class="line">   <span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseB</span> &#123;</span><br><span class="line">   <span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseB FuncC\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> BaseA, <span class="keyword">public</span> BaseB&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncC \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   BaseA a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct BaseA (primary base)</span><br><span class="line">        0 |     (BaseA vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">       16 |   struct BaseB (base)</span><br><span class="line">       16 |     (BaseB vtable pointer)</span><br><span class="line">       24 |     int a</span><br><span class="line">       28 |     int b</span><br><span class="line">          | [sizeof=32, dsize=32, align=8,</span><br><span class="line">          |  nvsize=32, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>类大小仍然是32，和上面一样。</p>
<p>虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (11 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Derive RTTI</span><br><span class="line">      -- (BaseA, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  2 | Derive::~Derive() [complete]</span><br><span class="line">  3 | Derive::~Derive() [deleting]</span><br><span class="line">  4 | void Derive::FuncB()</span><br><span class="line">  5 | void Derive::FuncC()</span><br><span class="line">  6 | offset_to_top (-16)</span><br><span class="line">  7 | Derive RTTI</span><br><span class="line">      -- (BaseB, 16) vtable address --</span><br><span class="line">  8 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line">  9 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line"> 10 | void Derive::FuncC()</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br></pre></td></tr></table></figure></p>
<p><img src="/img/20220316193501.jpg" alt=""></p>
<p>offset_to_top(0)：表示当前这个虚函数表（BaseA，Derive）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为0。</p>
<p>再注意这里的RTTI中有了两项，表示BaseA和Derive的虚表地址是相同的，BaseA类里的虚函数和Derive类里的虚函数都在这个链条下，截至到offset_to_top(-16)之前都是BaseA和Derive的虚函数表。</p>
<p>offset_to_top(-16)：表示当前这个虚函数表（BaseB）地址距离对象顶部地址的偏移量，因为对象的头部就是虚函数表的指针，所以偏移量为-16。当基类BaseB的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncC()时候，由于FuncC()已经被重写，而此时的this指针指向的是BaseB类型的对象，需要对this指针进行调整，就是offset_to_top(-16)，所以this指针向上调整了16字节，之后调用FuncC()，就调用到了被重写后Derive虚函数表中的FuncC()函数。这些带adjustment标记的函数都是需要进行指针调整的。至于上面所说的这里虚函数是怎么调用的，估计您也明白了吧~</p>
<h3 id="多重继承不同的继承顺序导致的类对象的布局相同吗？"><a href="#多重继承不同的继承顺序导致的类对象的布局相同吗？" class="headerlink" title="多重继承不同的继承顺序导致的类对象的布局相同吗？"></a>多重继承不同的继承顺序导致的类对象的布局相同吗？</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseA</span> &#123;</span><br><span class="line">   <span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseB</span> &#123;</span><br><span class="line">   <span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseB FuncC\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> BaseB, <span class="keyword">public</span> BaseA&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncC \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   BaseA a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct BaseB (primary base)</span><br><span class="line">        0 |     (BaseB vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">       16 |   struct BaseA (base)</span><br><span class="line">       16 |     (BaseA vtable pointer)</span><br><span class="line">       24 |     int a</span><br><span class="line">       28 |     int b</span><br><span class="line">          | [sizeof=32, dsize=32, align=8,</span><br><span class="line">          |  nvsize=32, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>这里可见，对象布局和上面的不相同啦，BaseB的虚函数表指针和数据在上面，BaseA的虚函数表指针和数据在下面，以A，B的顺序继承，对象的布局就是A在上B在下，以B，A的顺序继承，对象的布局就是B在上A在下。</p>
<p>虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (11 entries).</span><br><span class="line">  0 | offset_to_top (0)</span><br><span class="line">  1 | Derive RTTI</span><br><span class="line">      -- (BaseB, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  2 | Derive::~Derive() [complete]</span><br><span class="line">  3 | Derive::~Derive() [deleting]</span><br><span class="line">  4 | void Derive::FuncC()</span><br><span class="line">  5 | void Derive::FuncB()</span><br><span class="line">  6 | offset_to_top (-16)</span><br><span class="line">  7 | Derive RTTI</span><br><span class="line">      -- (BaseA, 16) vtable address --</span><br><span class="line">  8 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line">  9 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line"> 10 | void Derive::FuncB()</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br></pre></td></tr></table></figure></p>
<p><img src="/img/20220316193602.png" alt=""></p>
<p>虚函数表的布局也有所不同，BaseB和Derive共用一个虚表地址，在整个虚表布局的上方，而布局的下半部分是BaseA的虚表，可见继承顺序不同，子类的虚表布局也有所不同。</p>
<h3 id="虚继承的布局"><a href="#虚继承的布局" class="headerlink" title="虚继承的布局"></a>虚继承的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> Base&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   (Derive vtable pointer)</span><br><span class="line">        8 |   struct Base (virtual base)</span><br><span class="line">        8 |     (Base vtable pointer)</span><br><span class="line">       16 |     int a</span><br><span class="line">       20 |     int b</span><br><span class="line">          | [sizeof=24, dsize=24, align=8,</span><br><span class="line">          |  nvsize=8, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>虚继承下，这里的对象布局和普通单继承有所不同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和虚基类分别有一个虚表地址的指针，两个指针大小总和为16，再加上a和b的大小8，为24。</p>
<p>虚函数表：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (13 entries).</span><br><span class="line">  0 | vbase_offset (8)</span><br><span class="line">  1 | offset_to_top (0)</span><br><span class="line">  2 | Derive RTTI</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  3 | void Derive::FuncB()</span><br><span class="line">  4 | Derive::~Derive() [complete]</span><br><span class="line">  5 | Derive::~Derive() [deleting]</span><br><span class="line">  6 | vcall_offset (-8)</span><br><span class="line">  7 | vcall_offset (-8)</span><br><span class="line">  8 | offset_to_top (-8)</span><br><span class="line">  9 | Derive RTTI</span><br><span class="line">      -- (Base, 8) vtable address --</span><br><span class="line"> 10 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 11 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 12 | void Derive::FuncB()</span><br><span class="line">      [this adjustment: 0 non-virtual, -32 vcall offset offset]</span><br></pre></td></tr></table></figure></p>
<p>对象布局图如下：<br><img src="/img/20220316193603.png" alt=""></p>
<p>vbase_offset(8)：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量</p>
<p>vcall_offset(-8)：当虚基类Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数。</p>
<h3 id="虚继承带未覆盖函数的对象布局"><a href="#虚继承带未覆盖函数的对象布局" class="headerlink" title="虚继承带未覆盖函数的对象布局"></a>虚继承带未覆盖函数的对象布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Base FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Base FuncC\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> Base&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   Base a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   (Derive vtable pointer)</span><br><span class="line">        8 |   struct Base (virtual base)</span><br><span class="line">        8 |     (Base vtable pointer)</span><br><span class="line">       16 |     int a</span><br><span class="line">       20 |     int b</span><br><span class="line">          | [sizeof=24, dsize=24, align=8,</span><br><span class="line">          |  nvsize=8, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>和上面虚继承情况下相同，普通单继承下子类和基类共用一个虚表地址，而在虚继承下，子类和虚基类分别有一个虚表地址的指针，两个指针大小总和为16，再加上a和b的大小8，为24。</p>
<p>虚函数表布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (15 entries).</span><br><span class="line">  0 | vbase_offset (8)</span><br><span class="line">  1 | offset_to_top (0)</span><br><span class="line">  2 | Derive RTTI</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  3 | void Derive::FuncB()</span><br><span class="line">  4 | Derive::~Derive() [complete]</span><br><span class="line">  5 | Derive::~Derive() [deleting]</span><br><span class="line">  6 | vcall_offset (0)</span><br><span class="line">  7 | vcall_offset (-8)</span><br><span class="line">  8 | vcall_offset (-8)</span><br><span class="line">  9 | offset_to_top (-8)</span><br><span class="line"> 10 | Derive RTTI</span><br><span class="line">      -- (Base, 8) vtable address --</span><br><span class="line"> 11 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 12 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 13 | void Derive::FuncB()</span><br><span class="line">      [this adjustment: 0 non-virtual, -32 vcall offset offset]</span><br><span class="line"> 14 | void Base::FuncC()</span><br></pre></td></tr></table></figure></p>
<p><img src="/img/20220316193604.png" alt=""></p>
<p>vbase_offset(8)：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量</p>
<p>vcall_offset(-8)：当虚基类Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncB()时候，由于FuncB()已经被重写，而此时的this指针指向的是Base类型的对象，需要对this指针进行调整，就是vcall_offset(-8)，所以this指针向上调整了8字节，之后调用FuncB()，就调用到了被重写后的FuncB()函数。</p>
<p>vcall_offset(0)：当Base的引用或指针base实际接受的是Derive类型的对象，执行base-&gt;FuncC()时候，由于FuncC()没有被重写，所以不需要对this指针进行调整，就是vcall_offset(0)，之后调用FuncC()。</p>
<h3 id="菱形继承下类对象的布局"><a href="#菱形继承下类对象的布局" class="headerlink" title="菱形继承下类对象的布局"></a>菱形继承下类对象的布局</h3><figure class="highlight c++"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">struct</span> <span class="title class_">Base</span> &#123;</span><br><span class="line">   <span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">Base</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseA</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> Base &#123;</span><br><span class="line">   <span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseA</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseA FuncB\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">BaseB</span> : <span class="keyword">virtual</span> <span class="keyword">public</span> Base &#123;</span><br><span class="line">   <span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   <span class="keyword">virtual</span> ~<span class="built_in">BaseB</span>() = <span class="keyword">default</span>;</span><br><span class="line">   </span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncA</span><span class="params">()</span> </span>&#123;&#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;BaseB FuncC\n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="type">int</span> a;</span><br><span class="line">   <span class="type">int</span> b;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="keyword">struct</span> <span class="title class_">Derive</span> : <span class="keyword">public</span> BaseB, <span class="keyword">public</span> BaseA&#123;</span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncB</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncB \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line"></span><br><span class="line">   <span class="function"><span class="type">void</span> <span class="title">FuncC</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;</span><br><span class="line">       <span class="built_in">printf</span>(<span class="string">&quot;Derive FuncC \n&quot;</span>);</span><br><span class="line">  &#125;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line"><span class="function"><span class="type">int</span> <span class="title">main</span><span class="params">()</span> </span>&#123;</span><br><span class="line">   BaseA a;</span><br><span class="line">   Derive d;</span><br><span class="line">   <span class="keyword">return</span> <span class="number">0</span>;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>
<p>类对象布局：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line">*** Dumping AST Record Layout</span><br><span class="line">        0 | struct Derive</span><br><span class="line">        0 |   struct BaseB (primary base)</span><br><span class="line">        0 |     (BaseB vtable pointer)</span><br><span class="line">        8 |     int a</span><br><span class="line">       12 |     int b</span><br><span class="line">       16 |   struct BaseA (base)</span><br><span class="line">       16 |     (BaseA vtable pointer)</span><br><span class="line">       24 |     int a</span><br><span class="line">       28 |     int b</span><br><span class="line">       32 |   struct Base (virtual base)</span><br><span class="line">       32 |     (Base vtable pointer)</span><br><span class="line">       40 |     int a</span><br><span class="line">       44 |     int b</span><br><span class="line">          | [sizeof=48, dsize=48, align=8,</span><br><span class="line">          |  nvsize=32, nvalign=8]</span><br><span class="line"></span><br><span class="line">*** Dumping IRgen Record Layout</span><br></pre></td></tr></table></figure></p>
<p>大小为48，这里不用做过多介绍啦，相信您已经知道了吧。</p>
<p>虚函数表：<br><figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br></pre></td><td class="code"><pre><span class="line">Vtable for &#x27;Derive&#x27; (20 entries).</span><br><span class="line">  0 | vbase_offset (32)</span><br><span class="line">  1 | offset_to_top (0)</span><br><span class="line">  2 | Derive RTTI</span><br><span class="line">      -- (BaseB, 0) vtable address --</span><br><span class="line">      -- (Derive, 0) vtable address --</span><br><span class="line">  3 | Derive::~Derive() [complete]</span><br><span class="line">  4 | Derive::~Derive() [deleting]</span><br><span class="line">  5 | void Derive::FuncC()</span><br><span class="line">  6 | void Derive::FuncB()</span><br><span class="line">  7 | vbase_offset (16)</span><br><span class="line">  8 | offset_to_top (-16)</span><br><span class="line">  9 | Derive RTTI</span><br><span class="line">      -- (BaseA, 16) vtable address --</span><br><span class="line"> 10 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line"> 11 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line"> 12 | void Derive::FuncB()</span><br><span class="line">      [this adjustment: -16 non-virtual]</span><br><span class="line"> 13 | vcall_offset (-32)</span><br><span class="line"> 14 | vcall_offset (-32)</span><br><span class="line"> 15 | offset_to_top (-32)</span><br><span class="line"> 16 | Derive RTTI</span><br><span class="line">      -- (Base, 32) vtable address --</span><br><span class="line"> 17 | Derive::~Derive() [complete]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 18 | Derive::~Derive() [deleting]</span><br><span class="line">      [this adjustment: 0 non-virtual, -24 vcall offset offset]</span><br><span class="line"> 19 | void Derive::FuncB()</span><br><span class="line">      [this adjustment: 0 non-virtual, -32 vcall offset offset]</span><br></pre></td></tr></table></figure></p>
<p>对象布局图如下：<br><img src="/img/20220316193605.png" alt=""></p>
<p>vbase_offset (32)</p>
<p>vbase_offset (16)：对象在对象布局中与指向虚基类虚函数表的指针地址的偏移量</p>
<p>offset_to_top (0)</p>
<p>offset_to_top (-16)</p>
<p>offset_to_top (-32)：指向虚函数表的地址与对象顶部地址的偏移量。</p>
